Autodesk.Revit.DB.IFC.IFCLogical
A datatype can have values TRUE, FALSE, UNKNOWN or UNSET.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLogical.Unset
Unset.

Autodesk.Revit.DB.IFC.IFCLogical.Unknown
Unknown.

Autodesk.Revit.DB.IFC.IFCLogical.False
False.

Autodesk.Revit.DB.IFC.IFCLogical.True
True.